const DATA_VERSION = "20260606132055";

const DEFAULT_RECIPES = [
  {
    "id": "r1780752017971",
    "name": "鸡蛋羹",
    "image": "./images/jidangeng.webp",
    "category": [
      "早餐",
      "晚餐",
      "汤羹"
    ],
    "taste": [
      "清淡"
    ],
    "ingredients": [
      "鸡蛋",
      "温水",
      "盐",
      "浅口陶瓷容器或者碗",
      "小葱",
      "生抽",
      "香油"
    ],
    "time": "未知时间",
    "difficulty": "简单",
    "servings": "1-2人",
    "steps": [
      "1.烧开水晾到40度",
      "2.打三个鸡蛋在浅口陶瓷容器或者陶瓷碗中",
      "3.温水放四勺(汤大勺)或者使用蛋壳盛水4壳半",
      "4.放不到一茶勺的盐(特别小的茶勺)",
      "5.快速顺时针打散鸡蛋后用滤勺过滤一下，表面仍然存在的泡沫用勺子整出来",
      "6.蒸锅下面放冷水，浅口陶瓷容器放分隔层上面，锅盖留缝",
      "7.开大火把下面的水烧热看到盖子上有白气出来后立马转最小火蒸14分，或者保鲜膜盖上扎洞蒸十分钟",
      "8.勺子背面轻打蛋液如果没有粘在勺子上就好了，如果沾了再蒸两分钟",
      "9.放1把小葱，两勺生抽，半勺香油"
    ],
    "tips": "1.水温：40度温水更好，手指放进去能微微热但是不烫，没有温水就选择开水或者凉白开\n2.鸡蛋和水的比例：1：1.5（嫩） 1：1.8(更嫩)  简单一点判断就是一个鸡蛋按照50g算，一个鸡蛋需要水一勺半，三个鸡蛋就放4勺\n3.盐的用量：一个鸡蛋放0.8g，三个放2.4g\n4.不要使用不锈钢盆，使用浅口陶瓷容器或者陶瓷碗\n5.小火蒸的时间：1-2鸡蛋12分钟， 3-4个鸡蛋14分钟，  5-6个鸡蛋17分钟，容器很深的话加两分钟"
  }
];

const DEFAULT_CATEGORIES = [
  "早餐",
  "午餐",
  "晚餐",
  "夜宵",
  "下午茶",
  "甜品",
  "汤羹",
  "凉菜",
  "素食",
  "主食",
  "小吃",
  "家常",
  "硬菜",
  "宴客"
];

const DEFAULT_TASTES = [
  "麻辣",
  "酸辣",
  "酸甜",
  "咸香",
  "酱香",
  "蒜香",
  "葱油",
  "清淡",
  "鲜香",
  "红烧",
  "糖醋",
  "椒盐",
  "五香",
  "咖喱",
  "孜然"
];

const DEFAULT_INGREDIENTS = [
  "猪肉",
  "五花肉",
  "排骨",
  "鸡肉",
  "牛肉",
  "羊肉",
  "虾",
  "鱼",
  "鸡蛋",
  "牛奶",
  "豆腐",
  "土豆",
  "番茄",
  "青菜",
  "白菜",
  "茄子",
  "青椒",
  "黄瓜",
  "胡萝卜",
  "洋葱",
  "西兰花",
  "蘑菇",
  "葱",
  "姜",
  "蒜",
  "辣椒",
  "花椒",
  "生抽",
  "老抽",
  "醋",
  "料酒",
  "蚝油",
  "豆瓣酱",
  "面粉",
  "大米",
  "面条",
  "白砂糖",
  "冰糖",
  "食用油",
  "盐",
  "温水",
  "浅口陶瓷容器或者碗",
  "小葱",
  "香油"
];
